#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

google_service_account.service_account: Refreshing state... [id=projects/cloudresume-380001/serviceAccounts/cloud-run-invoker@cloudresume-380001.iam.gserviceaccount.com]
google_compute_managed_ssl_certificate.default: Refreshing state... [id=projects/cloudresume-380001/global/sslCertificates/cloud-resume-cert]
google_compute_global_address.default: Refreshing state... [id=projects/cloudresume-380001/global/addresses/resume]
google_storage_bucket.default: Refreshing state... [id=davidbour-cloud-resume]
google_compute_backend_bucket.default: Refreshing state... [id=projects/cloudresume-380001/global/backendBuckets/cloud-resume-backend-bucket]
google_storage_bucket_iam_member.default: Refreshing state... [id=b/davidbour-cloud-resume/roles/storage.objectViewer/allUsers]
google_firebase_project.default: Refreshing state... [id=projects/cloudresume-380001]
google_project_service.firebase_database: Refreshing state... [id=cloudresume-380001/firebasedatabase.googleapis.com]
google_project_iam_member.cloudrun-invoker: Refreshing state... [id=cloudresume-380001/roles/run.invoker/serviceAccount:cloud-run-invoker@cloudresume-380001.iam.gserviceaccount.com]
google_compute_url_map.default: Refreshing state... [id=projects/cloudresume-380001/global/urlMaps/http-lb]
google_compute_target_https_proxy.default: Refreshing state... [id=projects/cloudresume-380001/global/targetHttpsProxies/cloud-https-proxy]
google_compute_global_forwarding_rule.default: Refreshing state... [id=projects/cloudresume-380001/global/forwardingRules/https-lb-forwarding-rule]
google_firebase_database_instance.default: Refreshing state... [id=projects/cloudresume-380001/locations/us-central1/instances/cloudresume-380001-default-rtdb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_managed_ssl_certificate.default must be replaced
-/+ resource "google_compute_managed_ssl_certificate" "default" {
      ~ certificate_id            = 7176687731073687000 -> (known after apply)
      ~ creation_timestamp        = "2023-03-26T13:01:10.486-07:00" -> (known after apply)
      ~ expire_time               = "2023-06-24T13:01:12.000-07:00" -> (known after apply)
      ~ id                        = "projects/cloudresume-380001/global/sslCertificates/cloud-resume-cert" -> (known after apply)
      ~ name                      = "cloud-resume-cert" -> "cloud-resume-cert-1" # forces replacement
      ~ project                   = "cloudresume-380001" -> (known after apply)
      ~ self_link                 = "https://www.googleapis.com/compute/v1/projects/cloudresume-380001/global/sslCertificates/cloud-resume-cert" -> (known after apply)
      ~ subject_alternative_names = [
          - "davidbour.com",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ managed {
          ~ domains = [ # forces replacement
                "davidbour.com",
              + "api.davidbour.com",
              + "www.davidbour.com",
            ]
        }
    }

  # google_compute_target_https_proxy.default will be updated in-place
  ~ resource "google_compute_target_https_proxy" "default" {
        id                 = "projects/cloudresume-380001/global/targetHttpsProxies/cloud-https-proxy"
        name               = "cloud-https-proxy"
      ~ ssl_certificates   = [
          - "https://www.googleapis.com/compute/v1/projects/cloudresume-380001/global/sslCertificates/cloud-resume-cert",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @david-bour, Action: `pull_request`*